app/controllers/event_venues_controller.rb

  def index
    @event_venues = EventVenue.all
---
SELECT "event_venues".* FROM "event_venues"