app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (start_date > '2019-04-10') AND (start_date < '2019-07-10')
---
  def upcoming_events
    today = Date.today
    three_months_later = today + 3.month
    @event = Event.where("start_date > ? and start_date < ?", today, three_months_later)