app/controllers/tickets_controller.rb

  def index
    ticket_type = params[:ticket_type_id]
    if ticket_type
      @tickets = Ticket.where(ticket_type_id: ticket_type)
    else
      @tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ?  [["ticket_type_id", 1]]
SELECT "tickets".* FROM "tickets"