app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # (user_params[:name], user_params[:lastname], user_params[:email], user_params[:password], user_params[:address])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-04-10 13:42:52.203286"], ["updated_at", "2019-04-10 13:42:52.203286"]]

  def user_with_most_tickets
    sql = "select orders.user_id, count(tickets.order_id) n from orders, tickets where tickets.order_id = orders.id group by orders.user_id order by n desc limit 1"
    records_array = ActiveRecord::Base.connection.execute(sql)
    @user = User.find(records_array[0]['user_id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]